Revit 2027 API
BuiltInFailures.ImageFailures.InvalidWidth Property
 The image width must be must be no more than 30000 feet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidWidth { get; }
Public Shared ReadOnly Property InvalidWidth As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidWidth {
	FailureDefinitionId^ get ();
}
static member InvalidWidth : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImageFailures Class
Autodesk.Revit.DB Namespace